[
  {
    "title": "1. A Stranger's Smile",
    "poem": "A stranger first, a name on a screen,\nUnknown worlds behind eyes unseen,\nA “hello” typed, so simple, so small,\nYet in that moment, I felt it all.\n\nCuriosity sparked, hearts drew near,\nLaughs through texts, voices sincere,\nFrom strangers we danced in digital space,\nLearning each secret, each hidden trace.\n\nNo map, no plan, just fate's sweet art,\nTwo wandering souls, a start to start,\nEvery word, every line, built the thread,\nLeading us closer with each thing said."
  },
  {
    "title": "2. From Hello to Heartbeat",
    "poem": "Conversations deepened, night after night,\nFriendship blossomed, warm and bright,\nSecrets shared in a virtual room,\nA bond growing, dispelling gloom.\n\nYou laughed, I smiled, across the miles,\nMoments stretching, endless trials,\nFrom simple talks to inside jokes,\nOur hearts spoke louder than mere pokes.\n\nWhat began as strangers, shy and new,\nTurned into a world I shared with you,\nFrom fleeting chats to comfort and cheer,\nEvery day you became more dear."
  },
  {
    "title": "3. The Close One",
    "poem": "From strangers, friends, now something more,\nA heart I cherish, adore, explore,\nThe late-night talks, the little fights,\nThe way we held each other through digital nights.\n\nEvery “good morning” brought a glow,\nEvery “good night” made time slow,\nFrom casual words to tender care,\nA closeness only we could share.\n\nThough screens kept us physically apart,\nYou live, forever, inside my heart,\nWhat started unknown, now feels like home,\nWith you, I'm never truly alone."
  },
  {
    "title": "4. Realization",
    "poem": "It wasn't a moment, but a gentle flow,\nDay by day, you helped me know,\nThat love's not loud, it's soft and true,\nAnd all my roads lead back to you.\n\nYour kindness spoke louder than any word,\nIn your silence, my soul was heard,\nI found in you a calming sea,\nThe home I never thought would be.\n\nNot chance, not luck, but destiny's thread,\nThat tied my heart to all you said,\nAnd in that glow, my heart confessed,\nWith you, my soul feels most blessed."
  },
  {
    "title": "5. The One",
    "poem": "Your laughter lit a thousand skies,\nYour care was truth, no sweet disguise,\nI saw the woman, strong and bright,\nMy queen, my star, my guiding light.\n\nNot beauty alone, but soul so kind,\nRespect grew deep within my mind,\nFor every word, for every deed,\nYou became the answer to my need.\n\nNo more searching, no more roam,\nWith you, my heart had found its home,\nThe one I choose, the one I see,\nForevermore, it's you for me."
  },
  {
    "title": "6. Admiration",
    "poem": "I admired the way you love so pure,\nWith patience, grace, a heart secure,\nHow you lift me when I fall apart,\nAnd stitch the cracks within my heart.\n\nYour strength is quiet, your soul refined,\nA rarest gem, one hard to find,\nWith every step, you teach me more,\nOf life, of love, of what's in store.\n\nNot just a lover, but friend and guide,\nWith you I need no mask to hide,\nIn every way, in all you do,\nMy greatest pride is loving you."
  },
  {
    "title": "7. Respect",
    "poem": "I learned respect in the way you care,\nGentle honesty, always fair,\nYour voice a balm, your words so wise,\nYour truth reflected in your eyes.\n\nYou never ask, yet give so much,\nA healing soul, a tender touch,\nThrough miles apart, your strength I feel,\nA love unwavering, raw, and real.\n\nAnd so I bow to the love you show,\nMy admiration continues to grow,\nFor in your heart I see what's true,\nA queen, a guide, my dream, it's you."
  },
  {
    "title": "8. When Love Spoke",
    "poem": "It started with smiles, then nights grew long,\nA whisper of love inside felt strong,\nNo longer just friendship, but something new,\nA flame was born, I love you.\n\nEach word from you a sacred song,\nEach silence sweet, where hearts belong,\nI didn't plan, I didn't see,\nBut love had quietly chosen me.\n\nNo doubt remained, no fear, no wall,\nI knew with you I'd risk it all,\nFor what's more pure, what's more true,\nThan a forever built with you?"
  },
  {
    "title": "9. Fire Across Miles",
    "poem": "Though oceans stand and miles divide,\nYour love still burns deep inside,\nScreens can't dim the flame we share,\nA fire alive, beyond compare.\n\nYour voice, a touch I've never known,\nYet in my soul it feels like home,\nMy pulse runs wild at every call,\nI crave your presence most of all.\n\nNo map, no flight could ever explain,\nHow love survives through joy and pain,\nFor distance bows, it bends, it yields,\nTo the bond our burning love shields."
  },
  {
    "title": "10. My Forver",
    "poem": "I see my future in your eyes,\nNo fleeting dream, no sweet disguise,\nThe path is clear, the vow is near,\nWith you, my love, there's nothing to fear.\n\nEach day apart still builds our flame,\nEach moment whispers your sacred name,\nPatience blooms where longing stays,\nYet love grows stronger through the days.\n\nForever isn't just a word,\nIt's every promise, felt and heard,\nAnd in my heart, one truth I keep,\nMy love for you runs vast and deep."
  },
  {
    "title": "11. The Deepest Truth",
    "poem": "You are my comfort, my sweetest sin,\nThe safest place I've ever been,\nEach thought of you ignites my soul,\nWith you, my love, I feel whole.\n\nNot just desire, but something more,\nRespect, devotion, at the core,\nThrough playful laughs, through tender care,\nI find your spirit everywhere.\n\nAnd so this truth I can't undo,\nEach beat, each breath belongs to you,\nNo distance wide, no storm above,\nCan shake the roots of this true love."
  },
  {
    "title": "12. I'd Be the Devil",
    "poem": "If the world forbid, I'd break its law,\nFor you, my queen, I'd bare it raw,\nAn angel for most, but for you alone,\nI'd wear the devil, heart overthrown.\n\nI'd sin in love, I'd burn in flame,\nJust to whisper your sacred name,\nNo heaven needed, no saintly grace,\nJust your smile, your touch, your face.\n\nIf shadows rose, I'd never part,\nI'd guard your soul, I'd guard your heart,\nFor if I must fall, I'd gladly be,\nThe devil in love, eternally."
  },
  {
    "title": "13. You Taught Me Love",
    "poem": "You Taught Me Love\nI thought I knew what love could be,\nBut you unlocked the truth for me,\nNot fleeting sparks, not empty lies,\nBut endless joy in your sweet eyes.\n\nYou showed me love is patient, kind,\nIt holds the heart, it calms the mind,\nIt laughs, it cries, it fights, it stays,\nIt brightens nights and crowns the days.\n\nWith you, I learned what hearts are for,\nNot walls, but doors that open more,\nA gift so rare, so pure, so true,\nLove found its meaning, when I found you.\n"
  },
  {
    "title": "14. My Happiness",
    "poem": "My Happiness\nHappiness wears your gentle face,\nA calm, a warmth, a sweet embrace,\nEven from miles, you light my skies,\nMy joy is written in your eyes.\n\nNo riches compare, no crown, no gold,\nTo the love we share, the truth we hold,\nFor in your presence, even apart,\nI find a song within my heart.\n\nEach laugh you give, each word you send,\nTurns ordinary days to magic again,\nFor all my life, I swear it's true,\nMy happiest place will be with you."
  },
  {
    "title": "15. Pages and Promises",
    "poem": "I'll bring you the books your heart desires,\nStories to match our deepest fires,\nWe'll read beneath the soft night glow,\nSharing worlds only we will know.\n\nEach page a journey, hand in hand,\nBuilding dreams, as we had planned,\nYour laughter rising between each line,\nA melody forever mine.\n\nNo story ends, no chapter done,\nWith you my life has just begun,\nTogether we'll write, day by day,\nA love that never fades away."
  },
  {
    "title": "16. Caring for You",
    "poem": "I'll hold your hand when days feel long,\nI'll be your shield when things go wrong,\nIn every storm, in every test,\nYou'll find your shelter in my chest.\n\nI'll bring you tea when nights are cold,\nBe your warmth as we grow old,\nFrom morning light to evening skies,\nI'll keep the sparkle in your eyes.\n\nFor love is care, in little things,\nThe joy, the calm that living brings,\nAnd I will prove my vow is true,\nForever, I'll be caring for you."
  },
  {
    "title": "17. Across the World, Forever",
    "poem": "We'll wander streets in lands unknown,\nCollecting skies to call our own,\nFrom ocean waves to mountain air,\nEach step, each scene, with you I'll share.\n\nPassports stamped with love's embrace,\nMemories stitched in every place,\nA thousand journeys, yet all will show,\nThe greatest trip is to love you so.\n\nAnd when the maps are fully worn,\nNew dreams, new homes, will still be born,\nFor the world is ours, but my truth will stay,\nWith you, forever, come what may.\n"
  },
  {
    "title": "18. When We Fought",
    "poem": "There were nights we screamed instead of spoke,\nWords like daggers, sharp when they broke,\nLove felt fragile, hanging thin,\nAs if the end would soon begin.\n\nI hated the silence, the walls we built,\nThe heavy air, the sting of guilt,\nYou turned away, I turned to pride,\nBut deep inside, I only cried.\n\nWe said things neither truly meant,\nLet anger take the love we spent,\nAnd in those storms, I feared the day,\nOur hearts would choose to walk away.\n\nYet even then, through pain and fire,\nYou were the one my soul desired,\nAnd though the fights could tear and scar,\nI knew, my love, who you are.\n"
  },
  {
    "title": "19. My Realization, My Apology, My Promise",
    "poem": "I thought of life without your voice,\nA hollow world, an empty choice,\nAnd in that silence, I came to see,\nWithout your love, there's no real me.\n\nI'm sorry for the times I strayed,\nFor every harsh word I carelessly laid,\nFor the moments I thought to walk away,\nWhen all I needed was to stay.\n\nYour love is not a fleeting flame,\nIt's carved in stone, it bears my name,\nNo matter the storms, the distance, the years,\nI'll fight for you through doubts and tears.\n\nI promise, love, my heart is yours,\nThrough every trial, through all closed doors,\nNo fight, no fear can change this truth,\nYou are my forever, my sweetest proof.\n\nSo take my hand, forgive the past,\nLet's build a love that will always last,\nFor my soul belongs to only you,"
  },
  {
    "title": "20. My Promise to You",
    "poem": "I promise steadiness when storms collide,\nA steady hand, your faithful guide,\nTo meet you gently where you stand,\nAnd build our world with careful hands.\n\nI promise laughter on ordinary days,\nWarmth in winters, sunlight's rays,\nTo learn your hurts and soothe your fears,\nTo hold your heart through all our years.\n\nI promise truth when shadows play,\nTo choose your side, come what may,\nSmall daily vows ,  a thousand ways , \nTo love you deeper with each phase.\n\nI promise patience, space, and grace,\nTo keep your smile upon my face,\nNo turning back, no silent doubt , \nMy life, my love, my all ,  throughout."
  },
  {
    "title": "21. Continuum",
    "poem": "This is not an ending, nor a final page,\nBut a ribbon unrolling beyond the stage,\nA vow that stretches past sunrise and dust,\nAn echo of us bound in endless trust.\n\nIf stars burn out and galaxies slow,\nIf time's last heartbeat ever ceases to flow,\nStill will our promise quietly remain,\nA pulse of love in the great domain.\n\nWe are a story that space cannot sever,\nA thread that hums across forever,\nNot bound to ink, nor clock, nor fate,\nBut living where forever and always wait.\n\nSo hold my hand as worlds expand,\nAs seasons pass and new dreams land,\nThis love ,  our continuum ,  will ever be,\nPast this universe, it carries you and me."
  }
]
